[
  {
    "company": "Stardiag",
    "location": "Cluj, România",
    "period": "04.2023 - 07.2025",
    "position": "Dezvoltator aplicații web",
    "description": "Am contribuit la dezvoltarea unei aplicații web modulare folosind Angular și Go, concentrată pe oferirea unui serviciu complet și independent de management, incluzând autentificare, bază de date în timp real și control al accesului (ACL).",
    "skills": [
      "Am lucrat cu PostgreSQL, scriind interogări, funcții și folosind funcționalități precum JSONB, RLS și căutare full-text.",
      "Am participat la dezvoltarea API-ului backend, scriind cod Go pentru manipularea datelor și a logicii de business.",
      "Am participat la planificarea și discuțiile tehnice legate de arhitectura și structura aplicației."
    ]
  },
  {
    "company": "ELECTROSERVICE ROZELOR",
    "location": "Mangalia, România",
    "period": "06.2021 - 12.2022",
    "position": "Designer grafic comercial",
    "description": "Am gestionat un centru de design grafic, oferind soluții comerciale clienților din industria ospitalității, de la dezvoltarea unei identități de brand până la produse promoționale.",
    "skills": [
      "Am întreținut sistemele informatice și echipamentele de producție.",
      "Am asistat clienții în dezvoltarea identității vizuale pentru afacerea lor.",
      "Am creat materiale comerciale, inclusiv: fluturași, meniuri pentru restaurante, grafică pentru vitrine, logo-uri.",
      "Am operat diverse echipamente de producție precum: cutter laser, cutter plotter, presă de transfer termic."
    ]
  },
  {
    "company": "Atelier de electronică auto",
    "location": "Mangalia, România",
    "period": "04.2014 - 04.2021",
    "position": "Tehnician electronist auto",
    "description": "Am lucrat ca electronist auto într-un atelier specializat în diagnosticarea și repararea problemelor electrice și electronice complexe pentru o gamă largă de mărci auto.",
    "skills": [
      "Am efectuat diagnosticări și analize de sistem pentru identificarea și remedierea problemelor tehnice în electronica auto.",
      "Am folosit echipamente de diagnostic și am interpretat scheme electrice pentru a detecta defecțiuni în sistemele electrice și electronice."
    ]
  }
]
